justcallmekoko/ESP32Marauder/esp32_marauder/WiFiScan.h
    bool scan_complete = false;

    //int num_beacon = 0; // GREEN
    //int num_probe = 0; // BLUE
    //int num_deauth = 0; // RED

    uint32_t initTime = 0;
    bool run_setup = true;
    void initWiFi(uint8_t scan_mode);
    uint8_t bluetoothScanTime = 5;
    int packets_sent = 0;
    const wifi_promiscuous_filter_t filt = {.filter_mask=WIFI_PROMIS_FILTER_MASK_MGMT | WIFI_PROMIS_FILTER_MASK_DATA};
    #ifdef HAS_BT
      NimBLEScan* pBLEScan;
    #endif

    //String connected_network = "";
    //const String alfa = "1234567890qwertyuiopasdfghjkklzxcvbnm QWERTYUIOPASDFGHJKLZXCVBNM_";

    const char* rick_roll[8] = {
      "01 Never gonna give you up",
      "02 Never gonna let you down",
      "03 Never gonna run around",
      "04 and desert you",
      "05 Never gonna make you cry",
      "06 Never gonna say goodbye",
      "07 Never gonna tell a lie",
      "08 and hurt you"
    };

    char* prefix = "G";

    typedef struct
    {
      int16_t fctl;
      int16_t duration;
      uint8_t da;
      uint8_t sa;
      uint8_t bssid;
      int16_t seqctl;
      unsigned char payload[];
    } __attribute__((packed)) WifiMgmtHdr;
    
    typedef struct {
      uint8_t payload[0];
      WifiMgmtHdr hdr;
    } wifi_ieee80211_packet_t;

		// Tracking structures for PineScan (similar to MultiSSID)
    struct PineScanTracker {
        uint8_t mac[6];
        bool suspicious_oui;
        bool tag_and_susp_cap;
        uint8_t channel;
        int8_t rssi;
        bool reported;
    };

    // For confirmed Pineapple devices
    struct ConfirmedPineScan {
        uint8_t mac[6];
        String detection_type;
        String essid;
        uint8_t channel;
        int8_t rssi;
        bool displayed;
    };
    LinkedList<PineScanTracker>* pinescan_trackers;
    LinkedList<ConfirmedPineScan>* confirmed_pinescan;
    bool pinescan_list_full_reported;
    
    // Security Conditions For Pineapple detection
    enum SecurityCondition {
        NONE = 0x00,
        SUSPICIOUS_WHEN_OPEN = 0x01,
        SUSPICIOUS_WHEN_PROTECTED = 0x02,
        SUSPICIOUS_ALWAYS = 0x04
    };

    // SuspiciousVendor struct
    struct SuspiciousVendor {
        const char* vendor_name;
        uint8_t security_flags;
        uint32_t ouis[20];                 // Array of OUIs (max 20 per vendor)
        uint8_t oui_count;                 // Number of OUIs for this vendor
    };

    // Declare the table for Pineapple
    static const SuspiciousVendor suspicious_vendors[];
    static const int NUM_SUSPICIOUS_VENDORS;

    // Track for AP list limit (Uninitialised, Done in RunSetup)
    bool ap_list_full_reported;

    // MULTI SSID STRUCTS

    struct MultiSSIDTracker {
        uint8_t mac[6];
        uint16_t ssid_hashes[MULTISSID_THRESHOLD];
        uint8_t unique_ssid_count;
        bool reported;
    };

    // New struct for confirmed MultiSSID devices
    struct ConfirmedMultiSSID {
        uint8_t mac[6];
        String essid;
        uint8_t channel;
        int8_t rssi;
        uint8_t ssid_count;
        bool displayed;
    };
    LinkedList<MultiSSIDTracker>* multissid_trackers;
    LinkedList<ConfirmedMultiSSID>* confirmed_multissid;
    bool multissid_list_full_reported;

    // barebones packet
    uint8_t packet[128] = { 0x80, 0x00, 0x00, 0x00, //Frame Control, Duration
                    /*4*/   0xff, 0xff, 0xff, 0xff, 0xff, 0xff, //Destination address 
                    /*10*/  0x01, 0x02, 0x03, 0x04, 0x05, 0x06, //Source address - overwritten later
                    /*16*/  0x01, 0x02, 0x03, 0x04, 0x05, 0x06, //BSSID - overwritten to the same as the source address
                    /*22*/  0xc0, 0x6c, //Seq-ctl
                    /*24*/  0x83, 0x51, 0xf7, 0x8f, 0x0f, 0x00, 0x00, 0x00, //timestamp - the number of microseconds the AP has been active
                    /*32*/  0x64, 0x00, //Beacon interval
                    /*34*/  0x01, 0x04, //Capability info
                    /* SSID */
                    /*36*/  0x00
                    };

    uint8_t prob_req_packet[128] = {0x40, 0x00, 0x00, 0x00, 
                                  0xff, 0xff, 0xff, 0xff, 0xff, 0xff, // Destination
                                  0x01, 0x02, 0x03, 0x04, 0x05, 0x06, // Source
                                  0xff, 0xff, 0xff, 0xff, 0xff, 0xff, // Dest
                                  0x01, 0x00, // Sequence
                                  0x00, // SSID Parameter
                                  0x00, // SSID Length
                                  /* SSID */
                                  };

    uint8_t deauth_frame_default[26] = {
                              0xc0, 0x00, 0x3a, 0x01,
                              0xff, 0xff, 0xff, 0xff, 0xff, 0xff,
                              0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
                              0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
                              0xf0, 0xff, 0x02, 0x00
                          };

    uint8_t eapol_packet_bad_msg1[153] = {
                              0x08, 0x02,                         // Frame Control (EAPOL)
                              0x00, 0x00,                         // Duration
                              0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, // Destination (Broadcast)
                              0x00, 0x00, 0x00, 0x00, 0x00, 0x00, // Source (BSSID)
                              0x00, 0x00, 0x00, 0x00, 0x00, 0x00, // BSSID
                              0x00, 0x00,                         // Sequence Control
                              /* LLC / SNAP */
                              0xaa, 0xaa, 0x03, 0x00, 0x00, 0x00,
                              0x88, 0x8e,                          // Ethertype = EAPOL
                              /* -------- 802.1X Header -------- */
                              0x02,                               // Version 802.1X‑2004
                              0x03,                               // Type Key
                              0x00, 0x75,                          // Length 117 bytes
                              /* -------- EAPOL‑Key frame body (117 B) -------- */
                              0x02,                               // Desc Type 2 (AES/CCMP)
                              0x00, 0xCA,                          // Key Info (Install|Ack…)
                              0x00, 0x10,                          // Key Length = 16
                              /* Replay Counter (8) */
                              0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x01,
                              /* Nonce (32) */
                              0x00, 0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07,
                              0x08, 0x09, 0x0a, 0x0b, 0x0c, 0x0d, 0x0e, 0x0f,
                              0x10, 0x11, 0x12, 0x13, 0x14, 0x15, 0x16, 0x17,
                              0x18, 0x19, 0x1a, 0x1b, 0x1c, 0x1d, 0x1e, 0x1f,
                              /* Key IV (16) */
                              0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
                              0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
                              /* Key RSC (8) */
                              0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
                              /* Key ID  (8) */ 
                              0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
                              /* Key MIC (16) */ 
                              0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
                              0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
                              /* Key Data Len (2) */ 
                              0x00, 0x16,
                              /* Key Data (22 B) */
                              0xDD, 0x16,                // Vendor‑specific (PMKID IE)
                              0x00, 0x0F, 0xAC, 0x04,      // OUI + Type (PMKID)
                              /* PMKID (16 byte zero) */
                              0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 
                              0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00
                          };

