justcallmekoko/ESP32Marauder/esp32_marauder/WiFiScan.h
      wifi_init_config_t cfg2 = WIFI_INIT_CONFIG_DEFAULT();
    #endif

    wifi_config_t ap_config;

    #ifdef HAS_SCREEN
      int8_t checkAnalyzerButtons(uint32_t currentTime);
    #endif
    void setMac();
    void renderRawStats();
    void renderPacketRate();
    void displayAnalyzerString(String str);
    String security_int_to_string(int security_type);
    char* stringToChar(String string);
    void RunSetup();
    int clearSSIDs();
    int clearAPs();
    int clearIPs();
    int clearAirtags();
    int clearFlippers();
    int clearStations();
    int clearPineScanTrackers();
    int clearMultiSSID();
    bool addSSID(String essid);
    int generateSSIDs(int count = 20);
    bool shutdownWiFi();
    bool shutdownBLE();
    bool scanning();
    bool joinWiFi(String ssid, String password, bool gui = true);
    String getStaMAC();
    String getApMAC();
    String freeRAM();
    void changeChannel();
    void changeChannel(int chan);
    void RunAPInfo(uint16_t index, bool do_display = true);
    void RunInfo();
    //void RunShutdownBLE();
    void RunSetMac(uint8_t * mac, bool ap = true);
    void RunGenerateRandomMac(bool ap = true);
    void RunGenerateSSIDs(int count = 20);
    void RunClearSSIDs();
    void RunClearAPs();
    void RunClearStations();
    void RunSaveSSIDList(bool save_as = true);
    void RunLoadSSIDList();
    void RunSaveAPList(bool save_as = true);
    void RunLoadAPList();
    void RunSaveATList(bool save_as = true);
    void RunLoadATList();
    void RunSetupGPSTracker();
    void channelHop();
    uint8_t currentScanMode = 0;
    void main(uint32_t currentTime);
    void StartScan(uint8_t scan_mode, uint16_t color = 0);
    void StopScan(uint8_t scan_mode);
    void setBaseMacAddress(uint8_t macAddr[6]);
    //const char* generateRandomName();

    bool save_serial = false;
    void startPcap(String file_name);
    void startLog(String file_name);
    void startGPX(String file_name);
    //String macToString(const Station& station);

    static void getMAC(char *addr, uint8_t* data, uint16_t offset);
    static void pwnSnifferCallback(void* buf, wifi_promiscuous_pkt_type_t type);
    static void beaconSnifferCallback(void* buf, wifi_promiscuous_pkt_type_t type);
    static void rawSnifferCallback(void* buf, wifi_promiscuous_pkt_type_t type);
    static void stationSnifferCallback(void* buf, wifi_promiscuous_pkt_type_t type);
    static void apSnifferCallback(void* buf, wifi_promiscuous_pkt_type_t type);
    static void apSnifferCallbackFull(void* buf, wifi_promiscuous_pkt_type_t type);
    static void deauthSnifferCallback(void* buf, wifi_promiscuous_pkt_type_t type);
    static void probeSnifferCallback(void* buf, wifi_promiscuous_pkt_type_t type);
    static void beaconListSnifferCallback(void* buf, wifi_promiscuous_pkt_type_t type);
    static void activeEapolSnifferCallback(void* buf, wifi_promiscuous_pkt_type_t type);
    static void eapolSnifferCallback(void* buf, wifi_promiscuous_pkt_type_t type);
    static void wifiSnifferCallback(void* buf, wifi_promiscuous_pkt_type_t type);
    static void pineScanSnifferCallback(void* buf, wifi_promiscuous_pkt_type_t type); // Pineapple
    static int extractPineScanChannel(const uint8_t* payload, int len); // Pineapple
    static void multiSSIDSnifferCallback(void* buf, wifi_promiscuous_pkt_type_t type); // MultiSSID

    /*#ifdef HAS_BT
      enum EBLEPayloadType
      {
        Microsoft,
        Apple,
        Samsung,
        Google
      };

      struct BLEData
      {
        NimBLEAdvertisementData AdvData;
        NimBLEAdvertisementData ScanData;
      };

      struct WatchModel
      {
          uint8_t value;
          const char *name;
      };

      WatchModel* watch_models = nullptr;

      const WatchModel watch_models[] = {
        {0x1A, "Fallback Watch"},
        {0x01, "White Watch4 Classic 44m"},
        {0x02, "Black Watch4 Classic 40m"},
        {0x03, "White Watch4 Classic 40m"},
        {0x04, "Black Watch4 44mm"},
        {0x05, "Silver Watch4 44mm"},
        {0x06, "Green Watch4 44mm"},
        {0x07, "Black Watch4 40mm"},
        {0x08, "White Watch4 40mm"},
        {0x09, "Gold Watch4 40mm"},
        {0x0A, "French Watch4"},
        {0x0B, "French Watch4 Classic"},
        {0x0C, "Fox Watch5 44mm"},
        {0x11, "Black Watch5 44mm"},
        {0x12, "Sapphire Watch5 44mm"},
        {0x13, "Purpleish Watch5 40mm"},
        {0x14, "Gold Watch5 40mm"},
        {0x15, "Black Watch5 Pro 45mm"},
        {0x16, "Gray Watch5 Pro 45mm"},
        {0x17, "White Watch5 44mm"},
        {0x18, "White & Black Watch5"},
        {0x1B, "Black Watch6 Pink 40mm"},
        {0x1C, "Gold Watch6 Gold 40mm"},
        {0x1D, "Silver Watch6 Cyan 44mm"},
        {0x1E, "Black Watch6 Classic 43m"},
        {0x20, "Green Watch6 Classic 43m"},
      };
    #endif*/
};
#endif
